{
  "posts": [
    {
      "id": "150",
      "blogId": "1",
      "header": "How Should I Give My Dog A Bath?",
      "img": "https://cdn3-www.dogtime.com/assets/uploads/2012/05/dog-bathing-e1571421548676.jpg",
      "descriptionSmall": "1-Brush your dog before a bath : Matted hair holds water leaving your dog with irritated skin. If you can’t brush or cut the mats out yourself take your dog to a professional groomer. You may want to put a cotton ball in each ear to keep water out. It helps prevent ear infections and irritation. ",
      "bigDescrtion": "1- Brush your dog before a bath : Matted hair holds water, leaving your dog with irritated skin. If you can’t brush or cut the mats out yourself, take your dog to a professional groomer. You may want to put a cotton ball in each ear to keep water out. It helps prevent ear infections and irritation. 2- Use lukewarm water :  Dog skin is different from ours, and hot water can burn dogs more easily. Bath water should never be hotter than what you’d run for a human baby. Keep it even cooler for large-breed dogs who can easily overheat.3- Talk to your pet in a calm and reassuring voice : Some dogs will eventually learn that you’re not torturing them, although others will continue to hide under the kitchen table whenever you get out a towel.4- Use dog shampoo : It dries their skin less than people shampoo. Work the shampoo into a gentle lather and massage it all over your dog’s body, being careful not to get soap in their eyes.5- Rinse well. : Any soap left in their fur can irritate your dog’s skin once they’re dry. Rinse, rinse, and repeat the rinse.6- Air-dry : Hot air from a human blow-dryer can be too hot for their skin. Either air-dry or use a blow-dryer designed for dogs; its lower temperatures won’t cause itching or dandruff.7- Reward your dog :  Follow up with abundant praise, petting, or play. Many a damp dog loves to vent their frustration over bath time by playing exuberant tug-of-war with the bath towel–or just running away with it–when it’s all over. "
    },
    {
      "id": "151",
      "blogId": "1",
      "header": "Dog Playtime: Tips for Safe Family Play",
      "img": "https://www.fourpaws.com/-/media/images/fourpaws-na/us/articles/dog-playtime-927x388.jpg?h=388&la=en&w=927&hash=26005D83B5AA528CBF2553DB9E711FBCE5179EF0",
      "descriptionSmall": "Although a game of tag may seem like a good idea and dogs love to chase they may nip or bite if they get too excited. Consider a game of hide-and-seek instead. The dog is it in this game. To begin, have the child hide in fairly easy places. Hold the dog until the child has hidden and then tell him to find her.",
      "bigDescrtion": " 'Although a game of tag may seem like a good idea and dogs love to chase they may nip or bite if they get too excited. Consider a game of hide-and-seek instead. The dog is it in this game. To begin, have the child hide in fairly easy places. Hold the dog until the child has hidden and then tell him to find her. Occasionally a child may need to make a noise to help direct the dog but dogs generally catch on very quickly and have no trouble finding the children.Toys offer interactive fun as well. Many dogs love to retrieve balls and retrieving is good safe exercise. Make sure that the ball fits the dog a Chihuahua can’t manage a tennis ball and some balls may be a choking hazard for big dogs. The Four Paws® Crunch & Crackle Tug can work as both an interactive toy and one that a dog may play with by himself. Many dogs enjoy tug-of-war but again be ready to stop the game if the dog becomes too serious. Teach your child to drop the toy if the game becomes too rough.'"
    },
    {
      "id": "152",
      "blogId": "1",
      "header": "How To Curb Unwanted Dog Behaviors",
      "img": "https://lh3.googleusercontent.com/proxy/4jIJfgj4oNMI68S2AiJRBZyaDsb4eHYjm0AgD1vmojzqseOMx6Rmxyi9ePvg83f2CohxkhMoUxNs9-eW7zVY-QcAOf3VjfFASkzits53XeEW9ZVu",
      "descriptionSmall": "If the unwanted behavior is jumping on people, remember that any attention, good or bad, is still attention. After a couple of weeks of being completely ignored by you, your dog will figure out that it isn’t getting him what he wants – your attention.To stop bad behaviors like this, it’s important",
      "bigDescrtion": "If the unwanted behavior is jumping on people, remember that any attention, good or bad, is still attention. After a couple of weeks of being completely ignored by you, your dog will figure out that it isn’t getting him what he wants – your attention.To stop bad behaviors like this, it’s important to consider how you respond to the bad behavior. If you yell at your dog when he jumps on people, you are letting him know his bad behavior paid off.Think about what your dog is trying to accomplish when he’s misbehaving and don’t allow him to be rewarded for it. Instead, give him an opportunity to succeed (for example, tell the begging dog to go to his place and lie down, and give him a treat when he does).Behaviors like counter surfing may take longer to stop, and honestly, you may never achieve complete trustworthiness. Because dogs can easily smell that food has been on the counter, they will try for a very long time, just in case a crumb is left up there.If you can make sure that they never, ever find anything good there, then maybe they will give up. This is not easy to do, especially if you have a family. Sooner or later, someone will leave something within reach, and this will give the dog reason to keep checking. Try to make sure your counter is kept as clean as possible – and put your dog in her crate or in the fenced backyard when you are preparing food.Remember that you are communicating with an animal that speaks a different language. To help improve your dog’s behavior, training is key. Try to introduce a new command a week, and practice old ones with him. Besides being able to understand what you want him to do, the mental work involved in him learning commands will tire him out, making him less likely to misbehave."
    },
    {
      "id": "153",
      "blogId": "1",
      "header": "How to Cut Your Dog’s Nails",
      "img": "https://petlifetoday.com/wp-content/uploads/2018/07/Vet-trimming-a-dogs-nails.jpg",
      "descriptionSmall": "1- Hold the foot steady, but hold it gently.2- Snip off a small bit of the end of each toenail.Using either the guillotine or scissors-type clippers, place a tiny bit of the nail in the nail clipper and snip.If the nail feels spongy while you’re trying to cut it, stop immediately",
      "bigDescrtion": "1- Hold the foot steady, but hold it gently.2- Snip off a small bit of the end of each toenail.Using either the guillotine or scissors-type clippers, place a tiny bit of the nail in the nail clipper and snip.If the nail feels spongy while you’re trying to cut it, stop immediately — you’re cutting the quick!3- Stop any bleeding immediately.If you cut the quick (often called quicking), you’ll have an unhappy dog and a bloody mess. The quick bleeds a great deal, so if you cut it, you need either a nail cauterizer — a tool that stops the bleeding by applying heat — or styptic powder you can apply with a cotton swab. Have a damp washcloth at hand ready to clean up styptic powder and blood as necessary.Quicking hurts a lot, and most dogs remember the experience long afterward."
    },
    {
      "id": "154",
      "blogId": "1",
      "header": "Which human foods can dogs eat?",
      "img": "https://cdn-prod.medicalnewstoday.com/content/images/articles/324/324453/dog-standing-on-kitchen-table-licking-mouth-while-family-cook-food-in-background.jpg",
      "descriptionSmall": "1- Apples : Apples provide many important vitamins for dogs, including vitamins A and C.Apples are also a good source of fiber, which can help regulate a dog's digestion. However, eating rotting apples can lead to alcohol poisoning in dogs.2- White rice : Cooked, plain white rice can be a good option for a dog",
      "bigDescrtion": " 1- Apples : Apples provide many important vitamins for dogs, including vitamins A and C.Apples are also a good source of fiber, which can help regulate a dog's digestion. However, eating rotting apples can lead to alcohol poisoning in dogs.2- White rice : Cooked, plain white rice can be a good option for a dog with an upset stomach, as it is easy to digest and helps bind stool.White rice can cause blood sugar levels to rise, however, so dogs with diabetes should only eat it in small amounts.3 - Dairy products : Dairy products, such as milk, cheese, and plain yogurt, are safe for dogs to have in very small quantities.Eating too much dairy can cause digestive problems. This is because dogs have low levels of lactase, a digestive enzyme that breaks down the sugars in milk.Dogs with lactose intolerance should not eat dairy products. Signs of lactose intolerances include diarrhea or vomiting after consuming anything that contains dairy.4- Fish : Salmon, shrimp, and tuna are all safe for dogs to eat and good sources of protein.Salmon and tuna are rich sources of omega-3 fatty acids, which can help keep a dog's immune system, coat, and skin healthy.The B vitamins in shrimp can also help maintain a dog's digestive system and promote healthy blood circulation.It is important to cook fish before feeding it to a dog, as uncooked fish can contain harmful parasites.5- Chicken : Plain, boiled chicken with no seasoning is a good option when a dog has an upset stomach."
    },
    {
      "id": "155",
      "blogId": "1",
      "header": "Why Do Dogs Sleep So Much?",
      "bigDescrtion": "On average, dogs spend about 12-to-14 hours of the 24-hour cycle sleeping.Older dogs need significant amounts of sleep simply because, as they age, living becomes more difficult. They tire out more easily and need rest in order to function properly. Puppies, like babies, spend a lot of time exhausting energy while playing and exploring their new surroundings. Because of this, they might need as much as 18-to-20 hours of sleep to recoup! And of course, all dogs need sleep, but it tends to be the bigger breeds that are known for constant dozing.The amount of sleep dogs need also depends on what they are bred to do. For instance, it’s necessary for working dogs to stay awake because of the physical and mental demands they face each day. Dogs that have tasks to hold their attention will spend most of the day active, dedicated to completing those tasks. Dogs that aren’t bred for a certain purpose and lead more sedentary lifestyles, however, will spend most of the day doing whatever they want (i.e. sleeping).",
      "descriptionSmall": "On average, dogs spend about 12-to-14 hours of the 24-hour cycle sleeping.Older dogs need significant amounts of sleep simply because, as they age, living becomes more difficult. They tire out more easily and need rest in order to function properly. Puppies, like babies, spend a lot of time",
      "img": "https://s3.amazonaws.com/cdn-origin-etr.akc.org/wp-content/uploads/2016/08/12191250/Golden-Retriever-Puppy-Sleeping-Couch.jpg"
    },
    {
      "id": "156",
      "blogId": "1",
      "header": "The Many Ways Dogs Enhance People's Lives?",
      "bigDescrtion": "PetFriendly.ca Home » Pet Care Tips » Day-to-Day Pet Care » How Dogs Help People:The Many Ways Dogs Enhance People's Lives:Our dogs are a part of our families.They provide love and laughter, comedy and comfort, and they share our homes and our lives. We wouldn't have it any other way! But they are also so much more, to so many people. Dogs are truly amazing creatures. Here are some of the many ways dogs help people.Service Dogs:There are many types of service dogs. Here are a few of the more common:Hearing dogs are trained to alert their handlers to household sounds such as doorbells or knocks, a ringing phone, smoke detector alarms, oven timers, crying babies, etc. Hearing dogs are used with both deaf and hearing-impaired people.Guide dogs seeing eye dogs help people who are blind or visually impaired. They are trained to help navigate around obstacles, under the direction of the person they are paired with. Guide dogs help people have more confidence in going about their day-to-day activities.Mobility dogs help with physical tasks. They do things like stabilize someone while they're walking, turn lights on or off, pick up dropped items, opening and closing doors,etc.Medical alert/response dogs have the ability to sense seizures before they actually occur. It's not known how they can sense this - but speculation is that these dogs can either sense a change in our body chemistry or in tiny muscle movements that humans cannot detect.Medical alert/response dogs provide people with advance notice that something is about to happen, giving the person time to take medication, move somewhere safe, or call for help. Dogs can also perform tasks like blocking people from stairways or helping them to rise to their feet, among many other tasks.",
      "descriptionSmall": "PetFriendly.ca Home » Pet Care Tips » Day-to-Day Pet Care » How Dogs Help People:The Many Ways Dogs Enhance People's Lives:Our dogs are a part of our families. They provide love and laughter, comedy and comfort, and they share our homes and our lives. We wouldn't have it any other way!",
      "img": "https://cdn.kinsights.com/cache/38/2b/382b1c4424f694a07e011fff15a5cc3a.jpg"
    },
    {
      "id": "157",
      "blogId": "1",
      "header": "Safety around dogs",
      "bigDescrtion": "Safety around dogsAlways ask permission before petting or touching someone else's dog.Most of the time, we encounter friendly, wiggly dogs in public. But you should be cautious if a dog goes still, becomes stiff, and/or is not wagging in a loose and friendly way.Don't corner a dog. All dogs have a sense of personal space, so watch their body language as you get closer (or the dog gets closer to you).When approached by a strange dog, stand quietly, hands at your sides and avoid eye contact. A dog's natural instinct is to chase, so if you run, a dog may chase. Watch the dog out of the corner of your eye and don't turn your back.Do not approach dogs in cars or on chains or ropes. Dogs can be protective about their territory and may feel a bit more vulnerable or defensive than usual. When dogs are tied up, they know they can't run away so their only defense will be to fight.To avoid startling dogs, don't approach or touch them while they're sleeping, fixated on something, or with their puppies.Never get between dogs who are fighting and keep your hands away from their heads.Leave dogs alone when they are eating, whether the dog is eating from a bowl or chewing a treat or any other high-value item. Like people, dogs don't like it when people get between them and their food.Don't reach over or through fences or barriers to pet or touch a dog.Never tease, chase or harass a dog.Don't enter a property containing a dog if you're not accompanied by the dog's person. Dogs can be protective of their family and territory and think it's their job to protect them.The dog-safe family:Children should always be accompanied around dogs, even the family dog.Supervising children around dogs not only protects the children from accidents but also protects the dog from harm by children who don't always know that touching animals in a certain way can hurt them.Don't leave babies unattended around dogs. Dogs may not realize that babies aren't as strong as adults or even know what a baby is.If you're expecting a baby, start early to get your dog used to the changes a baby will make in your dog's and your lives.Don't attempt or allow your children to attempt to remove anything (toys, food or other objects) from your dog's mouth. Instead, find something of equal or greater value to offer your dog as a trade.Teach your children about dog safety early and promote dog-safe practices.If you are considering bringing a new dog into your family, write down what your family is like and then consult your local shelter staff or do research on the Internet to learn about what kind of dog would be best for you.For more information about establishing a healthy relationship between your dog and your children, visit familypaws.com.",
      "descriptionSmall": "Safety around dogsAlways ask permission before petting or touching someone else's dog.Most of the time, we encounter friendly, wiggly dogs in public. But you should be cautious if a dog goes still, becomes stiff, and/or is not wagging in a loose and friendly way.Don't corner a dog.",
      "img": "https://news.images.itv.com/image/file/1928941/img.jpg"
    },
    {
      "id": "158",
      "blogId": "1",
      "header": "How to Care for a Sick Dog ?",
      "descriptionSmall": "When your dog is sick, you want to comfort her in every way possible. But how do you know that you're doing all the right things? We talked to Dr. Dani McVety, a veterinarian and co-founder of the veterinary hospice Lap of Love, to find out exactly what pet parents can do to help their sick dogs",
      "bigDescrtion": "When your dog is sick, you want to comfort her in every way possible. But how do you know that you're doing all the right things? We talked to Dr. Dani McVety, a veterinarian and co-founder of the veterinary hospice Lap of Love, to find out exactly what pet parents can do to help their sick dogs feel better.Q: What are some signs that I should take my dog to the vet?Dr. McVety: Dogs will generally show some signs that things aren't completely perfect. Most commonly, they will either seek you out more than usual, or hide more than usual.We now have some evidence that their facial expressions change as well. The eyes may be more squinted, tail tucked under, posture lower than normal. These all vary by breed of course, but note a significant deviation from the normal. As a veterinarian, I remind my clients that they know their pet's personality better than anyone.Q: How can I make it easier for my dog to take her pills?Dr. McVety: Giving your dog pills can be very frustrating! The human animal bond might be injured if the owner is frustrated with giving the medication, and the pet is running away. Hiding the pill in peanut butter, pill pouches, wet dog food, or even dissolving it in chicken broth [make sure the broth contains no onion and your vet says the pills are okay to dissolve] are some ideas to help make medication time a little easier. If you find the right combination, it could actually be a positive experience.Q: Are certain foods or treats extra comforting to a sick dog?Dr. McVety: This certainly depends on the type of disease the pet has. Low-sodium chicken broth is necessary for any kind of kidney issues, and there are some subconscious caring feelings that occur when we give our own dog chicken noodle soup! Otherwise, single protein and simple carbohydrate meals will be the gentlest on a pet's stomach. For example, chicken and plain rice.",
      "img": "http://jmsstatic.s3.amazonaws.com/assets/thenoseprint/articles/How-to-Care-for-a-Sick-Dog/How-to-Care-for-a-Sick-Dog-header.jpg"
    },
    {
      "id": "159",
      "blogId": "1",
      "header": "Meeting a Dog For the First Time?",
      "bigDescrtion": "Do: Let the dog approach you When meeting a dog, it’s important to be calm and go slow. Your first instinct may be to run towards the dog with open arms, but not so fast! Approaching a dog in this way may startle them, and it can come off as intimidating. Instead, hold a natural stance, and allow the dog to come to you. You want to avoid coming across as fearful, however, as this can lead the dog to be defensive. Be careful, yet confident, when meeting a dog for the first time.Do: Let the dog sniff youIntroducing yourself to a new dog is all about understanding the dog’s instincts. Dogs have an extremely keen sense of smell. They use scent to understand, and make decisions about, their environment. In just a few sniffs, a dog can get a feel for the gender, health, and even the history of another dog. When a dog sniffs a person, they can determine whether that person has a dog of their own, where in the neighborhood the person might live, and more. They can also pick up on a person’s unique scent to jog their memory as to whether and when they’ve met before! To let a dog sniff you, don’t extend your hand to their face. Instead, let the dog approach you and sniff your hand on their own terms.Don’t: Pet him on the head,When first meeting a dog, always take care to respect their boundaries. Petting on the head can be threatening for a dog, especially when the person petting them is a complete stranger. Rather than reach for his head right away, start by petting them gently on their back or shoulders. Then, you can work your way towards their face if they are comfortable with it.Do: Pay attention to body languageJust like humans, dogs communicate through body language. When it comes to decoding dog body language, we have a few tips. In general, things like a curved body, wagging tail, and excitedly circling around you is a good sign; it means they want to get to know you. Bowing down with front legs extended is a gesture that says “Play with me!”. Watch out for anything that could indicate an aggressive or threatening mood, like showing teeth or a stiff, erect tail. It’s also important to note that all dogs react differently to stress. Some may express discomfort or anxiety by licking their lips or yawning. This is considered normal behavior for a dog who is put in a stressful or unfamiliar situation.Do: Use a calm, low voice when meeting a dogIt’s common for people to use “baby talk” when first meeting a dog but the correct way to approach a dog is to speak in your normal voice. Keep it calm and low. Using a higher pitched voice can signal weakness as well as stress out the dog. Establish your relationship right from the start by emanating confidence and respect for any new dog you meet.",
      "descriptionSmall": "Do: Let the dog approach you When meeting a dog, it’s important to be calm and go slow. Your first instinct may be to run towards the dog with open arms, but not so fast! Approaching a dog in this way may startle them, and it can come off as intimidating. Instead, hold a natural stance",
      "img": "https://i0.wp.com/www.simplypets.com/wp-content/uploads/2019/05/small.jpg?fit=970%2C505&ssl=1"
    }
  ]
}